Revit 2027 API
FabricationPart.LiningThickness Property
 The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LiningThickness { get; }
Public ReadOnly Property LiningThickness As Double
	Get
public:
property double LiningThickness {
	double get ();
}
member LiningThickness : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace